
const provincesData = [
    {
    name:'北京',
    code: 110000,
   },
    {
    name:'天津',
    code: 120000,
   },
    {
    name:'上海',
    code: 310000,
   },
    {
    name:'重庆',
    code: 500000,
   },
    {
    name:'河北',
    code: 130000,
   },
    {
    name:'河南',
    code: 410000,
   },
    {
    name:'云南',
    code: 530000,
   },
    {
    name:'辽宁',
    code: 210000,
   },
    {
    name:'黑龙江',
    code: 230000,
   },
    {
    name:'湖南',
    code: 430000,
   },
    {
    name:'安徽',
    code: 340000,
   },
    {
    name:'山东',
    code: 370000,
   },
    {
    name:'新疆',
    code: 650000,
   },
    {
    name:'江苏',
    code: 320000,
   },
    {
    name:'浙江',
    code: 330000,
   },
    {
    name:'江西',
    code: 360000,
   },
    {   
    name:'湖北',
    code: 420000,
   },
    {
    name:'广西',
    code: 450000,
   },
    {
    name:'甘肃',
    code: 620000,
   },
    {
    name:'山西',
    code: 140000,
   },
    {
    name:'内蒙古',
    code: 150000,
   },
    {   
    name:'陕西',
    code: 610000,
   },
    {   
    name:'吉林',
    code: 220000,
   },
    {
    name:'福建',
    code: 350000,
   },   
    {
    name:'贵州',
    code: 520000,
   },
    {
    name:'广东',
    code: 440000,
   },
    {
    name:'青海',
    code: 630000,
   },
    {
    name:'西藏',
    code: 540000,
   },
    {
    name:'四川',
    code: 510000,
   },
    {
    name:'宁夏',
    code: 640000,
   },
    {
    name:'海南',
    code: 460000,
   },
    {
    name:'台湾',
    code: 710000,
   },   
    {   
    name:'香港',
    code: 810000,
   },
    {
    name:'澳门',
    code: 820000,
   }        
];



const  provinces = {
    '上海': '310000',
    '河北': '130000',
    '山西': '140000',
    '内蒙古':  '150000',
    '辽宁':  '210000',
    '吉林':  '220000',
    '黑龙江':  '230000',
    '江苏':  '320000',
    '浙江':  '330000',
    '安徽':  '340000',
    '福建':  '350000',
    '江西':  '360000',
    '山东':  '370000',
    '河南': '410000',
    '湖北':  '420000',
    '湖南':  '430000',
    '广东':  '440000',
    '广西':  '450000',
    '海南':  '460000',
    '四川':  '510000',
    '贵州':  '520000',
    '云南':  '530000',
    '西藏':  '540000',
    '陕西':  '610000',
    '甘肃': '620000',
    '青海':  '630000',
    '宁夏':  '640000',
    '新疆':  '650000',
    '北京': '110000',
    '天津':  '120000',
    '重庆':  '500000',
    '香港':  '810000',
    '澳门':  '820000',
    '台湾':  '710000',
};




export {
    provinces,
    provincesData
}
